Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.Level Property
 The level at which the user property has been defined.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public UserPropertyLevelEnum Level { get; set; }
Public Property Level As UserPropertyLevelEnum
	Get
	Set
Property Value
Type: UserPropertyLevelEnum
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace